// 1. На вход подается 3-х значное число
// 2. Вывести последнюю цифру числа
Console.WriteLine("Введите целое 3-х значное число");
int a=Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Последняя цифра числа  {a}  будет  {a%10} ");



